#ifndef __DIGITAL_FILTER_H
#define __DIGITAL_FILTER_H

#include "arm_math.h"
#include "main.h"
#include "arm_const_structs.h"
#include "DSP/window_functions.h"
#include "math.h"
/****************************************************** FIR ******************************************************/
//#define FIR_NUMTAPS_LENGTH 				82				/* FIR滤波器的系数个数 */
//#define FIR_FSAMPLE						40960			/* FIR滤波器的采样率（MATLAB配置时所设置） */

//static const float32_t fir_pCoeffs[FIR_NUMTAPS_LENGTH] = {
//  0.0004879346473389,-0.0004785248679222,-0.0009282092169723,-0.001664391449104,
//  -0.002641027234618,-0.003793721683436,-0.005022727664347,-0.006191994056867,
//  -0.007137447773157,-0.007684605364346,-0.007671237556885,-0.006974287505306,
//  -0.005536442579934,-0.003387964449735,-0.0006601748022448, 0.002413159106912,
//   0.005510275601439,  0.00824873312064,  0.01022744310743,  0.01107707364068,
//    0.01051661801475, 0.008404743401539, 0.004781903359448,-0.0001077087744457,
//  -0.005811408332419, -0.01169284396699, -0.01698622525512, -0.02086123002942,
//   -0.02251656531583,  -0.0212693864439, -0.01664666827475,-0.008456817394994,
//   0.003160882521704,  0.01772313159941,   0.0344228064251,  0.05218842562275,
//    0.06977376253212,  0.08586965056168,  0.09922908213914,   0.1087882609222,
//     0.1137720546204,   0.1137720546204,   0.1087882609222,  0.09922908213914,
//    0.08586965056168,  0.06977376253212,  0.05218842562275,   0.0344228064251,
//    0.01772313159941, 0.003160882521704,-0.008456817394994, -0.01664666827475,
//    -0.0212693864439, -0.02251656531583, -0.02086123002942, -0.01698622525512,
//   -0.01169284396699,-0.005811408332419,-0.0001077087744457, 0.004781903359448,
//   0.008404743401539,  0.01051661801475,  0.01107707364068,  0.01022744310743,
//    0.00824873312064, 0.005510275601439, 0.002413159106912,-0.0006601748022448,
//  -0.003387964449735,-0.005536442579934,-0.006974287505306,-0.007671237556885,
//  -0.007684605364346,-0.007137447773157,-0.006191994056867,-0.005022727664347,
//  -0.003793721683436,-0.002641027234618,-0.001664391449104,-0.0009282092169723,
//  -0.0004785248679222,0.0004879346473389
//};


/****************************************************** IIR ******************************************************/
#define IIR_BLOCK_SIZE 		1					/* 调用一次 arm_biquad_cascade_df1_f32 函数处理的采样点个数 */
#define IIR_FSAMPLE			40960				/* IIR滤波器的采样率（MATLAB配置时所设置） */
#define IIR_NUMTAPS_LENGTH  5					/* 【节数】：2 阶 IIR 滤波的个数【滤波器阶数 = IIR_NUMTAPS_LENGTH * 2，每个 2 阶滤波器有 5 个系数】 */

static const float32_t iir_Coeffs32LP[5 * IIR_NUMTAPS_LENGTH] = {
	1, -1.785809833131859702959332025784533470869, 1, 1.813246408441423040969198154925834387541, -0.922895619642656428460725237528095021844,
	1, -1.727304914748456265982667900971136987209, 1, 1.655460192081843251443729059246834367514, -0.769366728357699369844624470715643838048,
	1, -1.531063358271729013537765240471344441175, 1, 1.472952401886268747333019746292848140001, -0.601434456853827237310383679869119077921,
	1, -0.722805775359134372592961881309747695923, 1, 1.291803430218046111477292470226529985666, -0.439181591701754026058068802740308456123,
	1,  1																				 , 0, 0.603922574530426525818427307967795059085, -0
};


/****************************************************** LMS ******************************************************/
#define LMS_BLOCK_SIZE           4096		/* 调用一次arm_lms_norm_f32处理的采样点个数 */
#define LMS_NUM_TAPS             16      	/* 滤波器系数个数 */


/****************************************************** Mid ******************************************************/
#define Mid_LENGTH  	32    		/* 采样点数 */
#define MidFilterOrder  128    		/* 滤波阶数 */
#define ZeroSize        MidFilterOrder




//-----------------------------------------------------------------------------------------------------------------------------------------
// 以下是函数定义：
//-----------------------------------------------------------------------------------------------------------------------------------------
extern uint8_t fir_fliter_function(float32_t *adc_value, float32_t* fir_output, uint32_t fir_length, uint32_t FIR_NUMTAPS_LENGTH, float32_t* fir_pCoeffs);
extern uint8_t iir_fliter_function(float32_t *adc_value, uint32_t fir_length);
extern void lms_filter_f32(float32_t* adc_value, float32_t* adc_ref, float32_t* lms_output, float32_t* lms_err, float32_t* lmsCoeffs32);
extern void mid_filter_f32(float32_t *pSrc, float32_t *pDst, uint8_t ucFlag, uint32_t order);


//---------------------------
// ADC常用滤波
//---------------------------
typedef struct {
	float Alpha;	/* 0 ~ 1 */
	double Pre_out;
	double Pre_in;
} Filter_t;
extern double low_pass_filter(Filter_t* filter, double input);
extern double High_Pass_Filter(Filter_t* filter, double input);


#define AVG_LEN 50	// 滑动均值滤波窗口长度
typedef struct {
	double Data[AVG_LEN];
	uint8_t index;
} AVG_Flt_t;
double average_filter(AVG_Flt_t* filter, double input);


#define MEDIAN_LEN 10	// 中值滤波窗口长度
typedef struct {
	double Data[MEDIAN_LEN];
	uint8_t index;
} MEDIAN_Flt_t;
double median_filter(MEDIAN_Flt_t* filter, double input);


typedef struct {
    float prevData;	// 0
    float p;		// 1
	float q;		// 0.003	q 控制误差 
	float r;		// 5	r 控制响应速度
	float kGain;    // 0
} KALMAN_Flt_t;
float kalman_filter(KALMAN_Flt_t* filter, double inData);

#endif
